tako0910/py32f0-template/Libraries/PY32F032_HAL_Driver/Inc/py32f032_hal_rcc_ex.h
/**
  ******************************************************************************
  * @file    py32f032_hal_rcc_ex.h
  * @author  MCU Application Team
  * @brief   Header file of RCC HAL Extended module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by Puya under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __PY32F032_HAL_RCC_EX_H
#define __PY32F032_HAL_RCC_EX_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "py32f032_hal_def.h"

/** @addtogroup PY32F032_HAL_Driver
  * @{
  */

/** @addtogroup RCCEx
  * @{
  */

/* Exported types ------------------------------------------------------------*/

/** @defgroup RCCEx_Exported_Types RCCEx Exported Types
  * @{
  */

/**
  * @brief  RCC extended clocks structure definition
  */
typedef struct
{
  uint32_t PeriphClockSelection;   /*!< The Extended Clock to be configured.
                                        This parameter can be a value of @ref RCCEx_Periph_Clock_Selection */
#if defined(RCC_BDCR_RTCSEL)
  uint32_t RtcClockSelection;      /*!< Specifies RTC clock source.
                                        This parameter can be a value of @ref RCC_RTC_Clock_Source */
#endif
  
#if defined(RCC_BDCR_IWDGSEL)
  uint32_t IwdgClockSelection;    /*!< Specifies IWDG clock source
                                        This parameter can be a value of @ref RCCEx_IWDG_Clock_Source */
#endif
  
#if defined(RCC_CCIPR_PVDSEL)
  uint32_t PvdDetectClockSelection;    /*!< Specifies PVD detect clock source.
                                        This parameter can be a value of @ref RCCEx_PVD_Detect_Clock_Source */
#endif
  
#if defined(RCC_CCIPR_COMP1SEL)
  uint32_t Comp1ClockSelection;    /*!< Specifies COMP1 clock source.
                                        This parameter can be a value of @ref RCCEx_COMP1_Clock_Source */
#endif

#if defined(RCC_CCIPR_COMP2SEL)
  uint32_t Comp2ClockSelection;    /*!< Specifies COMP2 clock source.
                                        This parameter can be a value of @ref RCCEx_COMP2_Clock_Source */
#endif

#if defined(RCC_CCIPR_LPUART1SEL)
  uint32_t Lpuart1ClockSelection;    /*!< Specifies LPUART1 clock source.
                                        This parameter can be a value of @ref RCCEx_LPUART1_Clock_Source */
#endif

#if defined(RCC_CCIPR_LPTIM1SEL)
  uint32_t Lptim1ClockSelection;    /*!< Specifies LPTIM1 clock source.
                                        This parameter can be a value of @ref RCCEx_LPTIM1_Clock_Source */
#endif

#if defined(RCC_CCIPR_TIM1SEL)
  uint32_t Tim1ClockSelection;    /*!< Specifies TIM1 clock source.
                                        This parameter can be a value of @ref RCCEx_TIM1_Clock_Source */
#endif

#if defined(RCC_CCIPR_TIM17SEL)
  uint32_t Tim17ClockSelection;    /*!< Specifies TIM17 clock source.
                                        This parameter can be a value of @ref RCCEx_TIM17_Clock_Source */
#endif

#if defined(RCC_CCIPR_ADCSEL)
  uint32_t AdcClockSelection;    /*!< Specifies ADC clock source.
                                        This parameter can be a value of @ref RCCEx_ADC_Clock_Source */
#endif
} RCC_PeriphCLKInitTypeDef;

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup RCCEx_Exported_Constants RCCEx Exported Constants
  * @{
  */
/** @defgroup RCCEx_LSC_Clock_Source Low Speed Clock Source
  * @{
  */
#define RCC_LSCSOURCE_LSI             0x00000000U           /*!< LSI selection for low speed clock output */
#if defined(RCC_LSE_SUPPORT)
#define RCC_LSCSOURCE_LSE             RCC_BDCR_LSCSEL       /*!< LSE selection for low speed clock output */
#endif
/**
  * @}
  */

/** @defgroup RCCEx_Periph_Clock_Selection Periph Clock Selection
  * @{
  */
#if defined(RCC_BDCR_RTCSEL)
#define RCC_PERIPHCLK_RTC              0x00000001U
#endif /* RCC_BDCR_RTCSEL */

#if defined(RCC_BDCR_IWDGSEL)
#define RCC_PERIPHCLK_IWDG             0x00000002U
#endif /* RCC_BDCR_IWDGSEL */

#if defined(RCC_CCIPR_PVDSEL)
#define RCC_PERIPHCLK_PVD              0x00000004U
#endif /* RCC_CCIPR_PVDSEL */

#if defined(RCC_CCIPR_COMP1SEL)
#define RCC_PERIPHCLK_COMP1            0x00000008U
#endif /* RCC_CCIPR_COMP1SEL */

#if defined(RCC_CCIPR_COMP2SEL)
#define RCC_PERIPHCLK_COMP2            0x00000010U
#endif /* RCC_CCIPR_COMP2SEL */

#if defined(RCC_CCIPR_LPUART1SEL)
#define RCC_PERIPHCLK_LPUART1          0x00000020U
#endif /* RCC_CCIPR_LPUART1SEL */

#if defined(RCC_CCIPR_LPTIM1SEL)
#define RCC_PERIPHCLK_LPTIM1           0x00000040U
#endif /* RCC_CCIPR_LPTIM1SEL */

#if defined(RCC_CCIPR_TIM1SEL)
#define RCC_PERIPHCLK_TIM1             0x00000080U
#endif /* RCC_CCIPR_TIM1SEL */

#if defined(RCC_CCIPR_TIM17SEL)
#define RCC_PERIPHCLK_TIM17            0x00000100U
#endif /* RCC_CCIPR_TIM17SEL */

#if defined(RCC_CCIPR_ADCSEL)
#define RCC_PERIPHCLK_ADC              0x00000200U
#endif /* RCC_CCIPR_ADCSEL */
/**
  * @}
  */

#if defined(RCC_BDCR_IWDGSEL)
/** @defgroup RCCEx_IWDG_Clock_Source IWDG Clock Source
  * @{
  */
#define RCC_IWDGCLKSOURCE_LSI         0x00000000U            /*!< LSI clock selected as IWDG clock */
#if defined(RCC_LSE_SUPPORT)
#define RCC_IWDGCLKSOURCE_LSE        RCC_BDCR_IWDGSEL       /*!< LSE clock selected as IWDG clock */
#endif
/**
  * @}
  */
#endif /* RCC_CCIPR_IWDGSEL */

